app/Controllers/Categoria.php

SELECT *
FROM `categoria`
WHERE `estado` = 1
---
    public function index()
    {
        $categorias = $this->categoria->where('estado', 1)->findAll();

SELECT *
FROM `categoria`
WHERE `estado` = 0
---
    public function eliminados()
    {
        $categorias = $this->categoria->where('estado', 0)->findAll();