app/Controllers/Habitacion.php

    public function index()
    {
        // Obtener habitaciones (puedes modificar la lógica según lo que necesites)
        $habitaciones = $this->habitacionModel->findAll();
---
SELECT *
FROM `habitacion`