app/Controllers/Habitacion.php

SELECT *
FROM `habitacion`
WHERE `estado` != 0
---
    public function index()
    {
        // Obtener habitaciones (puedes modificar la lógica según lo que necesites)
        $habitaciones = $this->habitacionModel->where('estado !=', 0)->findAll();

SELECT *
FROM `habitacion`
WHERE `estado` != 0
---
    public function accion()
    {
        // Obtener habitaciones (puedes modificar la lógica según lo que necesites)
        $habitaciones = $this->habitacionModel->where('estado !=', 0)->findAll();

UPDATE `habitacion` SET `numero` = '12', `precio` = '130.00', `piso` = '2', `categoria` = 'DOBLE', `estado` = '1', `fecha_actualizacion` = '2024-09-04 20:38:59'
WHERE `habitacion`.`id` IN ('1')
---
    public function actualizarbd()
    {
        // Obtener el ID de la habitación
        $idHabitacion = $this->request->getPost('id');

        // Datos de la habitación
        $habitacionData = [
            'numero' => strtoupper($this->request->getPost('numero')),
            'precio' => $this->request->getPost('precio'),
            'piso' => strtoupper($this->request->getPost('piso')),
            'categoria' => strtoupper($this->request->getPost('categoria')),
            'estado' => $this->request->getPost('estado')
        ];

        // Actualizar habitación
        $this->habitacionModel->update($idHabitacion, $habitacionData);