app/Controllers/Huesped.php

    public function eliminarbd($id)
    {
        $this->huespedModel->update($id, ['estado' => 0]);
---
UPDATE `huesped` SET `estado` = 0, `fecha_actualizacion` = '2024-09-05 15:57:05'
WHERE `huesped`.`id` IN ('1')

    public function integrar($id)
    {
        $this->huespedModel->update($id, ['estado' => 1]);
---
UPDATE `huesped` SET `estado` = 0
WHERE `huesped`.`id` IN ('6')