app/Controllers/Login.php

SELECT *
FROM `usuario`
WHERE `email` = 'torres.jose.13474@gmail.com'
 LIMIT 1
---
    public function validar()
    {
        $rules = [
            'email' => 'required',
            'password' => 'required'
        ];

        if ($this->validate($rules)) {
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            $datosusuario = $this->usuario->where('email', $email)->first();