app/Controllers/Producto.php

SELECT `producto`.*, `detalle_producto`.`precio_unitario`
FROM `producto`
LEFT JOIN `detalle_producto` ON `detalle_producto`.`id_producto` = `producto`.`id`
WHERE `producto`.`estado` = 1
---
    public function index()
    {
        // Aquí deberías unir la tabla 'detalle_producto' con 'productos'
        $productos = $this->productoModel
            ->select('producto.*, detalle_producto.precio_unitario')
            ->join('detalle_producto', 'detalle_producto.id_producto = producto.id', 'left')
            ->where('producto.estado', 1)
            ->findAll();

SELECT *
FROM `producto`
WHERE `producto`.`id` = '6'
---
    public function editar($id)
    {
        $producto = $this->productoModel->find($id);

UPDATE `producto` SET `nombre` = 'JOSE', `descripcion` = 'ADS', `precio_compra` = '11.00', `stock` = '1', `imagen` = '7.jpg'
WHERE `producto`.`id` IN ('7')
---
                }
            }

            if ($this->productoModel->update($id, $data)) {

SELECT *
FROM `producto`
WHERE `producto`.`id` = '3'
UPDATE `producto` SET `estado` = 0
WHERE `producto`.`id` IN ('3')
---
    public function eliminarbd($id)
    {
        $producto = $this->productoModel->find($id);
        if (!$producto) {
            return redirect()->to(base_url('producto'))->with('error', 'Producto no encontrado.');
        }

        $this->productoModel->update($id, ['estado' => 0]);