app/Controllers/Producto.php

UPDATE `producto` SET `estado` = 0, `fecha_actualizacion` = '2024-08-05 21:32:03'
WHERE `producto`.`id` IN ('52')
---
    public function eliminarbd($id)
    {
        $this->producto->update($id, ['estado' => 0]);