app/Controllers/Producto.php

    public function index()
    {
        $productos = $this->producto->where('estado', 1)->findAll();
---
SELECT *
FROM `producto`
WHERE `estado` = 1