app/Controllers/Usuario.php

    public function index()
    {
        /*if (!session()->get('isLoggedIn')) {
            return redirect()->to('login');
        }*/

        $usuarios = $this->usuario->where('estado', 1)->findAll();
---
SELECT *
FROM `usuario`
WHERE `estado` = 1

    public function agregarbd()
    {
        $rules = [
            'nombres' => 'required',
            'apellido_paterno' => 'required',
            'telefono' => 'required',
            'sueldo' => 'required',
            'rol' => 'required',
            'email' => 'required',
            'password' => 'required',
        ];
        if ($this->validate($rules)) {
            $data = [
                'nombres' => strtoupper($this->request->getPost('nombres')),
                'apellido_paterno' => strtoupper($this->request->getPost('apellido_paterno')),
                'apellido_materno' => strtoupper($this->request->getPost('apellido_materno')),
                'telefono' => $this->request->getPost('telefono'),
                'sueldo' => $this->request->getPost('sueldo'),
                'rol' => strtoupper($this->request->getPost('rol')),
                'email' => $this->request->getPost('email'),
                'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT)
            ];
            $this->usuario->save($data);
---
INSERT INTO `usuario` (`nombres`, `apellido_paterno`, `apellido_materno`, `telefono`, `rol`, `email`, `password`, `fecha_registro`, `fecha_actualizacion`) VALUES ('JOSE', 'TORRES', 'MAMANI', '76415956', 'ADMINISTRADOR', 'torres.jose.13474@gmail.com', '$2y$10$DXSxjXpvcb4HdRvdgergmOM.vtwOk3NIScuaj9ksC5JRil90orxM.', '2024-09-02 21:15:16', '2024-09-02 21:15:16')

    public function eliminados()
    {
        $usuarios = $this->usuario->where('estado', 0)->findAll();
---
SELECT *
FROM `usuario`
WHERE `estado` = 0

    public function editarpassword($id)
    {
        $usuario = $this->usuario->find($id);
---
SELECT *
FROM `usuario`
WHERE `usuario`.`id` = '27'