app/Models/HuespedModel.php

SELECT *, TIMESTAMPDIFF(YEAR, `fecha_nacimiento`, CURDATE()) as edad
FROM `huesped`
WHERE `estado` = 1
---
    public function getHuespedesConEdad()
    {
        $builder = $this->db->table($this->table);
        $builder->select('id, nombres, apellidos, nacionalidad, fecha_nacimiento, TIMESTAMPDIFF(YEAR, fecha_nacimiento, CURDATE()) AS edad','estado_civil', 'profesion', 'tipo_documento', 'numero_documento',
        'procedencia');
        $builder->where('estado', 1);
        $query = $builder->get();